In [1]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
})

df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.40  13
2  2.3  0.45  15

In [2]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [3]:
df.index = [2001, 2002, 2003]
df

       미국    한국  중국
2001  2.1  0.40  10
2002  2.2  0.40  13
2003  2.3  0.45  15

In [4]:
df.columns = ["일본", "필리핀", "러시아"]
df

       일본   필리핀  러시아
2001  2.1  0.40   10
2002  2.2  0.40   13
2003  2.3  0.45   15

In [5]:
df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.4 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [7]:
df = pd.DataFrame({
    "년도": [2000, 2010, 2020],
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
})

df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [13]:
df.set_index("년도", inplace=True)
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [12]:
df = df.reset_index("년도")
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [14]:
df.index.name

'년도'

In [15]:
df.index.name = "연도"
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [16]:
df.loc[2000] # 실제 인덱스명을 활용해서 인덱스에 해당하는 값 =행(record)의 값을 찾아온다.

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [17]:
df.iloc[0] # 인덱스명이 아닌, 인덱스의 연번=순번을 기준으로 record의 값을 찾아온다.

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [19]:
type(df["미국"])

pandas.core.series.Series

In [23]:
print(df["미국"][2010])
print(df.loc[2010]["미국"])

2.2
2.2

In [24]:
df.index

Index([2000, 2010, 2020], dtype='int64', name='연도')

In [25]:
df["미국"]

연도
2000    2.1
2010    2.2
2020    2.3
Name: 미국, dtype: float64

In [26]:
df["일본"] = [1, 2, 3]
df

       미국    한국  중국  일본
연도
2000  2.1  0.40  10   1
2010  2.2  0.40  13   2
2020  2.3  0.45  15   3

In [29]:
df = df.drop(columns=["일본"])
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [32]:
df.loc[2021] = [2.4, 0.46, 16]   # 미국, 한국, 중국 순서대로 값 입력
df

       미국    한국    중국
연도
2000  2.1  0.40  10.0
2010  2.2  0.40  13.0
2020  2.3  0.45  15.0
2021  2.4  0.46  16.0

In [34]:
df.drop([2021]) # drop - 임시 삭제
# df.drop(['2021'], inplace=True) # 완전 삭제
df

       미국    한국    중국
연도
2000  2.1  0.40  10.0
2010  2.2  0.40  13.0
2020  2.3  0.45  15.0
2021  2.4  0.46  16.0

In [37]:
df.drop([2021])

       미국    한국    중국
연도
2000  2.1  0.40  10.0
2010  2.2  0.40  13.0
2020  2.3  0.45  15.0

In [40]:
# df.drop([2020], inplace=True)
df2 = df[["중국", "한국"]].copy()
df2

        중국    한국
연도
2000  10.0  0.40
2010  13.0  0.40
2021  16.0  0.46

In [41]:
df2.columns = ["브라질", "아르헨티나"]
df2

       브라질  아르헨티나
연도
2000  10.0   0.40
2010  13.0   0.40
2021  16.0   0.46

In [42]:
df

       미국    한국    중국
연도
2000  2.1  0.40  10.0
2010  2.2  0.40  13.0
2021  2.4  0.46  16.0